Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: By default, the code consuming the event must be _non-blocking_, as it's called on an I/O thread. If your processing is blocking, use the `@io.smallrye.common.annotation.Blocking` annotation:
ja_jp: デフォルトでは、イベントを消費するコードは、I/Oスレッドで呼び出されるため、 _ノンブロッキング_ でなければなりません。処理がブロッキングの場合は、 `@io.smallrye.common.annotation.Blocking` アノテーションを使用してください。

source: By default, the code consuming the event must be _non-blocking_, as it's called on the Vert.x event loop. If your processing is blocking, use the `blocking` attribute:
ja_jp: デフォルトでは、Vert.x イベントループで呼び出されるため、イベントをコンシュームするコードは _ノンブロッキング_ でなければなりません。処理がブロッキングである場合は、 `blocking` 属性を使用してください。

source: By default, the command will target the `io.quarkus.platform:quarkus-bom:{quarkus-version}` platform release (unless the coordinates of the desired platform release have been specified).
ja_jp: デフォルトでは、コマンドは `io.quarkus.platform:quarkus-bom:{quarkus-version}` プラットフォームリリースをターゲットにします。(希望するプラットフォームリリースのコーディネートが指定されていない場合)。

source: By default, the command will target the `{quarkus-platform-groupid}:quarkus-bom:{quarkus-version}` platform release (unless the coordinates of the desired platform release have been specified).
ja_jp: デフォルトでは、コマンドは `{quarkus-platform-groupid}:quarkus-bom:{quarkus-version}` のプラットフォーム・リリースをターゲットにします（希望するプラットフォーム・リリースの座標が指定されていない場合）。

source: By default, the connector does wait for Kafka to acknowledge the record to continue the processing (acknowledging the received Message). You can disable this by setting the `waitForWriteCompletion` attribute to `false`.
ja_jp: デフォルトでは、コネクターは Kafka がレコードを確認応答するのを待ち、処理を続行します (受信したメッセージの確認応答)。これを無効にするには、 `waitForWriteCompletion` 属性を `false` に設定します。

source: By default, the connector does wait for Pulsar to acknowledge the record to continue the processing (acknowledging the received `Message`). You can disable this by setting the `waitForWriteCompletion` attribute to `false`.
ja_jp: デフォルトでは、コネクターは Pulsar がレコードを確認応答するのを待ってから、処理 (受信した `Message` の確認応答) を続行します。 これを無効にするには、 `waitForWriteCompletion` 属性を `false` に設定します。

source: By default, the connector writes Cloud Events using the binary mode. The connector generates a random `id` for each message. You can also customize the other Cloud Event attributes using `cloud-events-$attribute`, such as `cloud-events-subject`.
ja_jp: デフォルトでは、コネクタはバイナリーモードを使用してクラウドイベントを書き込みます。コネクタはメッセージごとにランダムな `id` を生成します。 `cloud-events-$attribute` を使用して、 `cloud-events-subject` などの他のクラウドイベント属性をカスタマイズすることもできます。

source: By default, the dialect is configured to target the minimum supported version of the database.
ja_jp: デフォルトでは、データベースの最小サポートバージョンをターゲットとするようにdialectが設定されています。

source: By default, the doc generator will use the hyphenated field name as the key of a `java.util.Map` configuration item. To override this default and have a user friendly key (independent of implementation details), you may use the `io.quarkus.runtime.annotations.ConfigDocMapKey` annotation. See the following example,
ja_jp: デフォルトでは、doc ジェネレータは `java.util.Map` 設定項目のキーとしてハイフンで囲まれたフィールド名を使用します。このデフォルトを上書きして（実装の詳細とは無関係に）ユーザーフレンドリーなキーを持つためには、 `io.quarkus.runtime.annotations.ConfigDocMapKey` アノテーションを使用することができます。以下の例を参照してください。

source: By default, the doc generator will use the hyphenated field name as the key of a `java.util.Map` configuration item. To override this default and have a user-friendly key (independent of implementation details), you may use the `io.quarkus.runtime.annotations.ConfigDocMapKey` annotation. See the following example,
ja_jp: デフォルトでは、doc ジェネレータは `java.util.Map` 設定項目のキーとしてハイフンで囲まれたフィールド名を使用します。このデフォルトを上書きして（実装の詳細とは無関係に）ユーザーフレンドリーなキーを持つためには、 `io.quarkus.runtime.annotations.ConfigDocMapKey` アノテーションを使用することができます。以下の例を参照してください。

source: By default, the documentation generator will use the hyphenated field name as the key of a `java.util.Map`. Use the `io.quarkus.runtime.annotations.ConfigDocMapKey` annotation to override the behaviour.
ja_jp: デフォルトでは、ドキュメント・ジェネレーターは、ハイフンで区切られたフィールド名を `java.util.Map` のキーとして使用します。 この動作をオーバーライドするには、 `io.quarkus.runtime.annotations.ConfigDocMapKey` アノテーションを使用します。

source: By default, the exporters will send out data in batches, using the gRPC protocol and endpoint `http://localhost:4317`.
ja_jp: デフォルトでは、エクスポータはgRPCプロトコルとエンドポイント `http://localhost:4317` を使用して、バッチでデータを送信します。

source: By default, the extension fetches resources from Keycloak on demand, using their URI to identify and map the application resources that require protection.
ja_jp: デフォルトでは、エクステンションは URI を使用して保護が必要なアプリケーションリソースを識別し、マッピングすることで、オンデマンドで Keycloak からリソースを取得します。

source: By default, the extension is going to fetch resources on-demand from Keycloak where their `URI` are used to map the resources in your application that should be protected.
ja_jp: デフォルトでは、エクステンションは Keycloak からオンデマンドでリソースを取得します。 `URI` は、保護されるべきアプリケーション内のリソースをマップするために使用されます。

source: By default, the extension uses lazy loading to fetch resources from Keycloak on demand. It uses the request URI to identify and map application resources that require protection.
ja_jp: デフォルトでは、エクステンションは必要に応じて Keycloak からリソースを遅延ロードします。リクエスト URI を使用して、保護が必要なアプリケーションリソースを識別し、マッピングします。

source: By default, the first unnamed parameter represents the id of a template that should be included. And it is taken as is. For example, `{#include bar/foo /}` includes a template with id `bar/foo`; i.e. `src/main/resources/templates/bar/foo.html` could be matched. However, it is also possible to supply the template id dynamically. Just add the `_id` parameter to the tag. In this case, the argument value of the `_id` parameter represents an expression that is resolved and the result represents the template id. For example, `{#include _id=bar.foo /}` means that `bar.foo` is first resolved and then the resulting template id is used.
ja_jp: デフォルトでは、最初の名前なしパラメーターは、インクルードされるテンプレートの ID を表します。そして、それはそのまま解釈されます。例えば、`{#include bar/foo /}` は ID `bar/foo` のテンプレートをインクルードします。つまり、`src/main/resources/templates/bar/foo.html` が一致する可能性があります。ただし、テンプレート ID を動的に指定することも可能です。タグに `_id` パラメーターを追加するだけです。この場合、`_id` パラメーターの引数値は解決される式を表し、その結果がテンプレート ID を表します。例えば、`{#include _id=bar.foo /}` は、まず `bar.foo` が解決され、その結果のテンプレート ID が使用されることを意味します。

source: By default, the following list of media types is compressed: `text/html`, `text/plain`, `text/xml`, `text/css`, `text/javascript` and `application/javascript`.
ja_jp: デフォルトでは、 `text/html` , `text/plain` , `text/xml` , `text/css` , `text/javascript` , `application/javascript` のメディアタイプが圧縮されます。

source: By default, the following list of media types is compressed: `text/html`, `text/plain`, `text/xml`, `text/css`, `text/javascript`, `application/javascript`, `application/json`, `application/graphql+json` and `application/xhtml+xml`.
ja_jp: デフォルトでは、以下のメディアタイプのリストが圧縮されます： `text/html` `text/plain` , `text/xml` , `text/css` , `text/javascript` , `application/javascript` , `application/json` , `application/graphql+json` および `application/xhtml+xml` 。

source: By default, the health checks are exposed on the main HTTP server. You can expose them on a separate network interface and port by enabling the management interface with the `quarkus.management.enabled=true` property. Refer to the xref:./management-interface-reference.adoc[management interface reference] for more information.
ja_jp: デフォルトでは、ヘルスチェックはメインのHTTPサーバー上で公開されます。 `quarkus.management.enabled=true` プロパティで管理インターフェイスを有効にすることで、別のネットワークインターフェイスとポートで公開することができます。詳細については、 xref:./management-interface-reference.adoc[管理インターフェイスのリファレンス] を参照してください。

source: By default, the health checks are exposed on the main HTTP server. You can expose them on a separate network interface and port by setting `quarkus.management.enabled=true` in your application configuration. Note that this property is a build-time property. The value cannot be overridden at runtime.
ja_jp: デフォルトでは、ヘルスチェックはメインのHTTPサーバー上で公開されます。アプリケーションの設定で `quarkus.management.enabled=true` を設定することで、別のネットワークインターフェイスとポートで公開することができます。このプロパティは、ビルド時のプロパティであることに注意してください。実行時に値をオーバーライドすることはできません。

source: By default, the https://quarkus.io/guides/opentelemetry[OpenTelemetry extension] will produce https://quarkus.io/guides/opentelemetry-tracing[traces]. https://quarkus.io/guides/opentelemetry-metrics[Metrics] and https://quarkus.io/guides/opentelemetry-logging[logs] must be enabled separately.
ja_jp: デフォルトでは、 https://quarkus.io/guides/opentelemetry[OpenTelemetry エクステンション] は https://quarkus.io/guides/opentelemetry-tracing[トレース] を生成します。 https://quarkus.io/guides/opentelemetry-metrics[メトリクス] と https://quarkus.io/guides/opentelemetry-logging[ログ] は個別に有効にする必要があります。

source: By default, the list of beans is sorted by priority as defined by `io.quarkus.arc.InjectableBean#getPriority()`. Higher priority goes first. In general, the `@javax.annotation.Priority` and `@io.quarkus.arc.Priority` annotations can be used to assign the priority to a class bean, producer method or producer field.
ja_jp: デフォルトでは，Beanのリストは， `io.quarkus.arc.InjectableBean#getPriority()` で定義された優先度によってソートされます。 高い優先度が最初になります。一般に， `@javax.annotation.Priority` 及び `@io.quarkus.arc.Priority` アノテーションを使用して，クラスBean，プロデューサメソッド又はプロデューサフィールドに優先度を割り当てることができます。

source: By default, the logout is based on the expiration time of the ID Token issued by the OpenID Connect Provider. When the ID Token expires, the current user session at the Quarkus endpoint is invalidated and the user is redirected to the OpenID Connect Provider again to authenticate. If the session at the OpenID Connect Provider is still active, users are automatically re-authenticated without having to provide their credentials again.
ja_jp: デフォルトでは、ログアウトはOpenID Connect Providerが発行したID Tokenの有効期限に基づいて行われます。IDトークンの有効期限が切れると、Quarkusエンドポイントでの現在のユーザーセッションは無効になり、ユーザーは認証のために再度OpenID Connect Providerにリダイレクトされます。OpenID Connect Providerでのセッションがまだアクティブな場合は、ユーザーは再び資格情報を提供することなく自動的に再認証されます。

source: By default, the management interface is exposed on the interface: `0.0.0.0` (all interfaces) and on the port `9000` (`9001` in test mode). It does not use TLS (`https`) by default.
ja_jp: デフォルトでは、マネジメントインタフェースはインターフェイス: `0.0.0.0` (すべてのインターフェイス) およびポート: `9000` (テストモードでは `9001`) で公開されます。また、デフォルトではTLS ( `https`) を使用しません。

source: By default, the message key consists of the method name followed by the `\_` separator and the constant name. If any constant name of a particular enum contains the `_` or the `$` character then the `\_$` separator must be used for all message keys for this enum instead. For example, `methodName_$CONSTANT_1=Value 1` or `methodName_$CONSTANT$1=Value 1`. A constant of a localized enum may not contain the `_$` separator.
ja_jp: デフォルトでは、メッセージキーにはメソッド名、その後に `\_` 区切り文字、定数名を使用して構成されます。 特定の列挙型の定数名に `_` または `$` 文字が含まれている場合、この列挙型のすべてのメッセージキーには代わりに `\_$` 区切り文字を使用する必要があります。 たとえば、`methodName_$CONSTANT_1 =Value 1` または `methodName_$CONSTANT$1 =Value 1` などです。 ローカライズされた列挙型の定数には、`_$` 区切り文字を含めることはできません。

source: By default, the metrics are exposed on the main HTTP server. If you would like to surface metrics from a separate management port, see the <<management-interface,Managed interface>> section.
ja_jp: デフォルトでは、メトリクスはメイン HTTP サーバーで公開されます。 別の管理ポートからメトリクスを表示する場合は、<<management-interface,Managed interface>> セクションを参照してください。

source: By default, the metrics are exposed on the main HTTP server. You can expose them on a separate network interface and port by enabling the management interface with the `quarkus.management.enabled=true` property. Refer to the xref:./management-interface-reference.adoc[management interface reference] for more information.
ja_jp: デフォルトでは、メトリクスはメインの HTTP サーバーで公開されます。 `quarkus.management.enabled=true` プロパティでマネジメントインターフェイスを有効にすると、別のネットワーク・インターフェイスおよびポートで公開することができます。詳細については、 xref:./management-interface-reference.adoc[マネジメントインターフェイスのリファレンス] を参照してください。

source: By default, the mock server will be in CRUD mode, so you have to use the client to build your state before your application can retrieve it, but you can also set it up in non-CRUD mode and mock all HTTP requests made to Kubernetes:
ja_jp: デフォルトでは、モックサーバはCRUDモードになっているので、アプリケーションがステートを取得する前に、クライアントを使ってステートを構築する必要がありますが、非CRUDモードに設定して、KubernetesへのすべてのHTTPリクエストをモックすることもできます。

source: By default, the native executable will be generated using the `quay.io/quarkus/ubi-quarkus-graalvmce-builder-image:{graalvm-flavor}` Docker image.
ja_jp: デフォルトでは、 `quay.io/quarkus/ubi-quarkus-graalvmce-builder-image:{graalvm-flavor}` Dockerイメージを使用してネイティブ実行可能ファイルが生成されます。

source: By default, the native executable will be generated using the `quay.io/quarkus/ubi-quarkus-mandrel-builder-image:{mandrel-flavor}` Docker image.
ja_jp: デフォルトでは、ネイティブ実行可能ファイルは `quay.io/quarkus/ubi-quarkus-mandrel-builder-image:{mandrel-flavor}` Dockerイメージを使用して生成されます。

source: By default, the native executable will be generated using the `quay.io/quarkus/ubi-quarkus-native-image:{graalvm-flavor}` Docker image.
ja_jp: デフォルトでは、 `quay.io/quarkus/ubi-quarkus-native-image:{graalvm-flavor}` Dockerイメージを使用してネイティブ実行可能ファイルが生成されます。

source: By default, the native executable will be generated using the `quay.io/quarkus/ubi9-quarkus-mandrel-builder-image:{mandrel-flavor}` Docker image.
ja_jp: デフォルトでは、ネイティブ実行可能ファイルは `quay.io/quarkus/ubi9-quarkus-mandrel-builder-image:{mandrel-flavor}` Dockerイメージを使って生成されます。

source: By default, the parser removes standalone lines from the template output. A *standalone line* is a line that contains at least one section tag (e.g. `{#each}` and `{/each}`), parameter declaration (e.g. `{@org.acme.Foo foo}`) or comment but no expression and no non-whitespace character. In other words, a line that contains no section tag or a parameter declaration is *not* a standalone line. Likewise, a line that contains an _expression_ or a _non-whitespace character_ is *not* a standalone line.
ja_jp: デフォルトでは、パーサーはテンプレート出力からスタンドアロン行を削除します。 *スタンドアロン行* とは、少なくとも 1 つのセクションタグ (例: `{#each}` や `{/each}`)、パラメーター宣言 (例: `{@org.acme.Foo foo}`)、またはコメントを含むけれど、式を含まず、空白以外の文字を含まない行のことになります。 言い換えれば、セクションタグやパラメーター宣言を含まない行は、*スタンドアロン行ではありません*。 同様に、_式_ または _非空白文字列_ を含む行も *スタンドアロン行ではありません*。

source: By default, the presence of this extension replaces the output format configuration from the console configuration, and the format string and the color settings (if any) are ignored. The other console configuration items, including those controlling asynchronous logging and the log level, will continue to be applied.
ja_jp: デフォルトでは、このエクステンションがあると、コンソール設定から出力フォーマット設定が置き換えられ、フォーマット文字列と色設定（もしあれば）は無視されます。 非同期ロギングやログレベルを制御するものを含む、 他のコンソール設定項目は引き続き適用されます。

source: By default, the presence of this extension replaces the output format configuration from the console configuration, and the format string and the color settings (if any) are ignored. The other console configuration items, including those that control asynchronous logging and the log level, will continue to be applied.
ja_jp: デフォルトでは、このエクステンションが存在すると、コンソール設定からの出力形式設定が置き換えられ、フォーマット文字列と色設定 (存在する場合) は無視されます。 非同期ロギングやログレベルを制御するものなど、その他のコンソール設定項目は引き続き適用されます。

source: By default, the recommended (latest release) will be selected but you can choose another one:
ja_jp: デフォルトでは、推奨（最新版）が選択されますが、別のものを選択することもできます。

source: By default, the request context is not activated when augmenting the security identity, this means that if you want to use for example Hibernate that mandates a request context, you will have a `jakarta.enterprise.context.ContextNotActiveException`.
ja_jp: デフォルトでは、セキュリティ・アイデンティティーを拡張する際に、リクエストコンテキストは有効になりません。これは、リクエストコンテキストを必須とするHibernateなどを使用したい場合、 `jakarta.enterprise.context.ContextNotActiveException` が発生することを意味します。

source: By default, the request context is not activated when augmenting the security identity, this means that if you want to use for example Hibernate that mandates a request context, you will have a `javax.enterprise.context.ContextNotActiveException`.
ja_jp: デフォルトでは、セキュリティ ID を拡張する際にリクエストコンテキストは有効になりません。これは、例えばリクエストコンテキストを必須とする Hibernate を使用したい場合、 `javax.enterprise.context.ContextNotActiveException` が発生することを意味します。

source: By default, the scheduler is configured with a simple instance ID generator using the machine hostname and the current timestamp, so you don't need to worry about setting a appropriate `instance-id` for each node when running in clustered mode. However, you can define a specific `instance-id` by yourself setting a configuration property reference or using other generators.
ja_jp: デフォルトでは、スケジューラはマシンホスト名と現在のタイムスタンプを使った単純なインスタンスIDジェネレーターで設定されているので、クラスターモードで実行する場合、各ノードに対して適切な `instance-id` を設定することを気にする必要はありません。しかし、自分で設定プロパティの参照を設定したり、他のジェネレーターを使ったりして、特定の `instance-id` を定義することができます。

source: By default, the scheduler is not started unless a `@Scheduled` business method is found. You may need to force the start of the scheduler for "pure" programmatic scheduling via `quarkus.scheduler.start-mode=forced`.
ja_jp: デフォルトでは、 `@Scheduled` ビジネスメソッドが見つからない限り、スケジューラは開始されません。「純粋な」プログラムによるスケジューリングでは、 `quarkus.scheduler.start-mode=forced` を使ってスケジューラを強制的に起動させる必要があるかもしれません。

source: By default, the scheduler is not started unless a `@Scheduled` business method is found. You may need to force the start of the scheduler for "pure" programmatic scheduling. See also <<quartz-configuration-reference>>.
ja_jp: デフォルトでは、 `@Scheduled` ビジネスメソッドが見つからない限り、スケジューラーは起動されません。純粋なプログラムによるスケジューリングを行うには、スケジューラーを強制的に起動させる必要があるかもしれません。 link:#quartz-configuration-reference[Quartz-configuration-reference] も参照してください。

source: By default, the scheduler is not started unless a `@Scheduled` business method is found. You may need to force the start of the scheduler for "pure" programmatic scheduling. See also <<quartz.adoc#quartz-configuration-reference,Quartz Configuration Reference>>.
ja_jp: デフォルトでは、 `@Scheduled` ビジネスメソッドが見つからない限り、スケジューラーは起動されません。「純粋な」プログラマティックスケジューリングのために、スケジューラーを強制的に起動する必要があるかもしれません。 link:quartz.html#quartz-configuration-reference[Quartz Configuration Reference] も参照してください。

source: By default, the scheduler is not started unless a `@Scheduled` business method is found. You may need to force the start of the scheduler for "pure" programmatic scheduling. See also xref:quartz-configuration-reference[Quartz Configuration Reference].
ja_jp: デフォルトでは、 `@Scheduled` ビジネスメソッドが見つからない限り、スケジューラーは起動されません。「純粋な」プログラマティックスケジューリングのために、スケジューラーを強制的に起動する必要があるかもしれません。 xref:quartz-configuration-reference[Quartz 設定リファレンス] も参照してください。

source: By default, the server is exposed on `localhost:9000`, and uses _plain-text_ (so no TLS) when running normally, and `localhost:9001` for tests.
ja_jp: デフォルトでは、通常、サーバーは `localhost:9000` で公開されており、 _平文_ を使用します(そのため TLS は使用しません)。テストでは、 `localhost:9001` を使用します。

source: By default, the service is not exposed to the outside world. Therefore, if you did not expose the created service automatically by setting the `quarkus.openshift.route.expose=true` property before building the application, you can expose the service manually.
ja_jp: デフォルトでは、サービスは外部に公開されません。 したがって、アプリケーションをビルドする前に `quarkus.openshift.route.expose=true` プロパティを設定して、作成したサービスを自動的に公開しなかった場合は、手動でサービスを公開することができます。

source: By default, the solution we have seen handles user and credential creation and logins automatically via the <<WebAuthn endpoints>> provided out of the box by this extension.
ja_jp: デフォルトでは、これまでに見てきたソリューションは、このエクステンションが標準で提供する <<WebAuthn endpoints>> を通じて、 ユーザーおよび認証情報の作成とログインを自動的に処理します。

source: By default, the syslog handler is disabled. When enabled, it sends all log events to a syslog server, typically the local syslog server for the application.
ja_jp: デフォルトでは、syslogハンドラは無効になっています。 有効にすると、すべてのログイベントを syslog サーバー（通常はアプリケーションのローカル syslog サーバー）に送信します。

source: By default, the tag template can reference data from the parent context. For example, the tag above could use the following expression `{items.size}`. However, sometimes it might be useful to disable this behavior and execute the tag as an _isolated_ template, i.e. without access to the context of the template that calls the tag. In this case, just add `_isolated` or `_isolated=true` argument to the call site, e.g. `{#itemDetail item showImage=true _isolated /}`.
ja_jp: デフォルトでは、タグテンプレートは親コンテキストからのデータを参照することができます。たとえば、上記のタグは `{items.size}` の式を使用することができます。しかし、時にはこの動作を無効にして、タグを _isolated_ テンプレートとして、つまり、タグを呼び出すテンプレートのコンテキストにアクセスせずに実行すると便利なことがあります。このような場合には、 `_isolated` または `_isolated=true` の引数を、たとえば `{#itemDetail item showImage=true _isolated /}` のように呼び出しサイトに追加してください。

source: By default, the templates defined in a class annotated with `@CheckedTemplate` can only contain type-safe expressions, i.e. expressions that can be validated at build time. You can use `@CheckedTemplate(requireTypeSafeExpressions = false)` to relax this requirement.
ja_jp: デフォルトでは、`@CheckedTemplate` でアノテーションされたクラスで定義されたテンプレートは、タイプセーフな式、つまり、ビルド時に検証可能な式のみを含むことができます。この要件を緩和するために、`@CheckedTemplate(requireTypeSafeExpressions = false)` を使用することができます。

source: By default, the thread Quarkus REST will run endpoint methods on depends on the signature of the method. If a method returns one of the following types then it is considered non-blocking, and will be run on the IO thread by default:
ja_jp: デフォルトでは、Quarkus REST スレッドは、メソッドのシグネチャーに応じてエンドポイントメソッドを実行します。メソッドが次のタイプのいずれかを返す場合、それは非ブロッキングと見なされ、デフォルトで IO スレッドで実行されます。

source: By default, the thread RESTEasy Reactive will run endpoint methods on depends on the signature of the method. If a method returns one of the following types then it is considered non-blocking, and will be run on the IO thread by default:
ja_jp: デフォルトでは、スレッド RESTEasy Reactive は、メソッドのシグネチャーに応じてエンドポイントメソッドを実行します。メソッドが次のタイプのいずれかを返す場合、それは非ブロッキングと見なされ、デフォルトで IO スレッドで実行されます。

source: By default, the token endpoint address is discovered by adding a `/.well-known/openid-configuration` path to the configured `quarkus.oidc-client.auth-server-url`.
ja_jp: デフォルトでは、トークンのエンドポイントアドレスは、設定された `quarkus.oidc-client.auth-server-url` に `/.well-known/openid-configuration` パスを追加することによって検出されます。

source: By default, the topic name is same as the channel name. You can configure the topic attribute to override it.
ja_jp: デフォルトでは、トピック名はチャネル名と同じです。トピック属性を設定することで、それを上書きすることができます。

source: By default, the underscore `_` of an Environment Variable name always maps to a dot `.`. If the property name contains a dash or some other special character, that property name can be specified in another Config Source, with the expected dotted format. It will provide additional information to perform a two-way conversion and match the property names.
ja_jp: デフォルトでは、環境変数名のアンダースコア `_` は、常にドット `.` にマッピングされます。プロパティ名にダッシュやその他の特殊文字が含まれている場合、そのプロパティ名は別の Config Source で指定することができ、期待通りのドット形式となります。これは、双方向の変換を実行し、プロパティ名を一致させるための追加情報を提供します。

source: By default, the xref:deploying-to-kubernetes.adoc[Kubernetes] extension doesn't generate the necessary resources to allow accessing secrets. Set `quarkus.kubernetes-config.secrets.enabled=true` to generate the necessary role and corresponding role binding.
ja_jp: デフォルトでは、 link:deploying-to-kubernetes[Kubernetes] エクステンションはSecretsにアクセスできるようにするために必要なリソースを生成しません。 `quarkus.kubernetes-config.secrets.enabled=true` を設定して、必要なロールと対応するロールバインディングを生成します。

source: By default, they are discovered by adding a `/.well-known/openid-configuration` path to the configured `quarkus.oidc.auth-server-url`.
ja_jp: デフォルトでは、これらのエンドポイントアドレスは、設定された `quarkus.oidc.auth-server-url` に `/.well-known/openid-configuration` パスを追加することで検出されます。

source: By default, this extension overrides the console output format configuration, and any format string or color settings are ignored. Other console configuration items continue to apply, including items that control asynchronous logging and the log level.
ja_jp: デフォルトでは、このエクステンションはコンソールの出力フォーマット設定をオーバーライドし、フォーマット文字列や色設定は無視されます。非同期ロギングやログレベルを制御する項目を含む、その他のコンソール設定項目は引き続き適用されます。
